Ironhack/timetracking/app/controllers/projects_controller.rb

  def show
    @project = Project.find_by(id: params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @project = Project.new(
      name: params[:project][:name],
      description: params[:project][:description])
    @project.save
---
INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Mikel"], ["description", "lalalalala"], ["created_at", "2016-04-27 08:14:32.703395"], ["updated_at", "2016-04-27 08:14:32.703395"]]