Ironhack/timetracking/app/controllers/time_entries_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
SELECT "time_entries".* FROM "time_entries" WHERE "time_entries"."project_id" = ? AND (date > '2016-03-27')  [["project_id", 2]]
---
  def index
    @project = Project.find_by(id: params[:project_id])
    unless @project
      render :no_projects_found
    end
    @time_entries = @project.time_entries.where("date > ?", Date.today.beginning_of_month)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 2]]
---
  def new
    @project = Project.find_by(id: params[:project_id])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "time_entries" ("hours", "minutes", "comments", "date", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @project = Project.find_by(id: params[:project_id])
    unless @project
      render :no_projects_found
    end
    @time_entry = @project.time_entries.new(entry_params)
    if @time_entry.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "time_entries".* FROM "time_entries" WHERE "time_entries"."project_id" = ? AND "time_entries"."id" = ? LIMIT 1  [["project_id", 2], ["id", 1]]
---
  def edit
    @project = Project.find_by(id: params[:project_id])
    unless @project
      render :no_projects_found
    end
    @time_entry = @project.time_entries.find_by(id: params[:id])